Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
AlarmID_t findAlarmByDevice(Sensor* device, bool isOn) {
    AlarmID_t result = -1;
    for (auto scheduleItem : schedules) {
        auto deviceToFind = scheduleItem.getDevice();
        if (device == deviceToFind) {
            result = isOn ? scheduleItem.getOn() : scheduleItem.getOff();
            break;
        }
    }
    return result;
}

void doserOnHandler(Sensor* device) {
    auto sensor = static_cast<Doser*>(device);

    /* getTime();
     String message;
     message = "Включение дозатора " + device->get.name;
     sendMessage(message);
     message.clear();

     switch (dos.type) {
         case K:
             doserK->begin();
             doserK->setEnableActiveState(LOW);
             doserK->move(dos.steps);
             doserK->setEnableActiveState(HIGH);
             break;
         case NP:
             doserNP->begin();
             doserNP->setEnableActiveState(LOW);
             doserNP->move(dos.steps);
             doserNP->setEnableActiveState(HIGH);
             break;
         case Fe:
             doserFe->begin();
             doserFe->setEnableActiveState(LOW);
             doserFe->move(dos.steps);
             doserFe->setEnableActiveState(HIGH);
             break;
         default:
             break;
     }




     if (device->getEnabled()) {
         Serial.printf_P(PSTR("%s: включение, pin %d\n"), device->getName().c_str(), device->getPin());
         shiftRegister.setPin(countShiftRegister, device->getPin(), HIGH);
         sendMessage(device, true);
         Alarm.enable(findAlarmByDevice(device, true));
         Alarm.enable(findAlarmByDevice(device, false));
         device->setStateNotify(true);
     } else {
         Serial.printf_P(PSTR("%s %s\n"), device->getName().c_str(), "нельзя изменять.");
         Alarm.disable(findAlarmByDevice(device, true));
         Alarm.disable(findAlarmByDevice(device, false));
     }
     */
}

void deviceOnHandler(Sensor* device) {
    getTime();
    if (device->getEnabled()) {
        Serial.printf_P(PSTR("%s: включение, pin %d\n"), device->getName().c_str(), device->getPin());
        shiftRegister.setPin(countShiftRegister, device->getPin(), HIGH);
        sendMessage(device, true);
        Alarm.enable(findAlarmByDevice(device, true));
        Alarm.enable(findAlarmByDevice(device, false));
        device->setStateNotify(true);
    } else {
        Serial.printf_P(PSTR("%s %s\n"), device->getName().c_str(), "нельзя изменять.");
        Alarm.disable(findAlarmByDevice(device, true));
        Alarm.disable(findAlarmByDevice(device, false));
    }
}

void deviceOffHandler(Sensor* device) {
    getTime();
    if (device->getEnabled()) {
        Serial.printf_P(PSTR("%s: выключение, pin %d\n"), device->getName().c_str(), device->getPin());
        shiftRegister.setPin(countShiftRegister, device->getPin(), LOW);
        sendMessage(device, false);
        Alarm.enable(findAlarmByDevice(device, true));
        Alarm.enable(findAlarmByDevice(device, false));
        device->setStateNotify(false);
    } else {
        Serial.printf_P(PSTR("%s %s\n"), device->getName().c_str(), "нельзя изменять.");
        Alarm.disable(findAlarmByDevice(device, true));
        Alarm.disable(findAlarmByDevice(device, false));
    }
}

void parseJSONLights(const String& response) {
    DynamicJsonDocument doc(1300);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string name = obj["name"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

            for (auto&& light : lights) {
                if (name == light.getName()) {
                    light.setState(state);
                    light.setEnabled(enabled);
                    light.setPin(pin);
                    light.setObjectID(objectId);
                    light.setOn(static_cast<time_t>(std::stoul(on)));
                    light.setOff(static_cast<time_t>(std::stoul(off)));
                }
            }
        }
        doc.shrinkToFit();
        doc.clear();
    }
}
void parseJSONDosersNew(const String& response) {
    DynamicJsonDocument document(1300);
    DeserializationError error = deserializeJson(document, response);
    if (error) {
        Serial.printf_P(PSTR("%s: %s"), "Невозможно выполнить парсинг", error.c_str());
        return;
    } else {
        JsonArray array = document.as<JsonArray>();
        for (JsonObject object : array) {
            uint8_t m0 = object["m0"];
            uint8_t m1 = object["m1"];
            uint8_t m2 = object["m2"];
            uint8_t index = object["index"];
            uint8_t dir = object["dir"];
            uint16_t steps = object["steps"];
            bool enabled = object["enabled"];
            uint8_t sleep = object["sleep"];
            uint16_t volume = object["volume"];
            uint8_t enable = object["enable"];
            std::string name = object["name"];
            uint8_t step = object["step"];
            bool state = object["state"];
            std::string objectId = object["objectId"];
            std::string on = object["on"];

            on = on.substr(0, 10);
            for (auto&& doserItem : dosers) {
                if (name == doserItem.getName()) {
                    doserItem.setState(state);
                    doserItem.setEnabled(enabled);
                    doserItem.setObjectID(objectId);
                    doserItem.setOn(static_cast<time_t>(std::stoul(on)));

                    doserItem.setMode0Pin(m0);
                    doserItem.setMode1Pin(m1);
                    doserItem.setMode2Pin(m2);
                    doserItem.setIndex(index);
                    doserItem.setDirPin(dir);
                    doserItem.setSteps(steps);
                    doserItem.setSleepPin(sleep);
                    doserItem.setVolume(volume);
                    doserItem.setEnablePin(enable);
                    doserItem.setStepPin(step);
                    /*
                    #ifdef ARDUINO_ARCH_ESP32
                                        emptyDoser = std_esp32::make_unique<GBasic>(dosersArray[ind].steps, dosersArray[ind].dirPin,
                                                                                    dosersArray[ind].stepPin,
                    dosersArray[ind].enablePin, dosersArray[ind].mode0_pin, dosersArray[ind].mode1_pin, dosersArray[ind].mode2_pin,
                    shiftRegister, dosersArray[ind].index); #else emptyDoser = std::make_unique<GBasic>(dosersArray[ind].steps,
                    dosersArray[ind].dirPin, dosersArray[ind].stepPin, dosersArray[ind].enablePin, dosersArray[ind].mode0_pin,
                    dosersArray[ind].mode1_pin, dosersArray[ind].mode2_pin, shiftRegister, dosersArray[ind].index); #endif switch
                    (doserItem.type) { case K: doserK = std::move(emptyDoser); break; case NP: doserNP = std::move(emptyDoser);
                                                break;
                                            case Fe:
                                                doserFe = std::move(emptyDoser);
                                                break;
                                            default:
                                                Serial.printf_P(PSTR("%s %s"), "Неизвестный тип дозатора",
                    ToString(doserItem.type)); break;
                                        }
                                        dosersArray[ind].alarm =
                                            Alarm.alarmRepeat(dosersArray[ind].hour, dosersArray[ind].minute, 0, doserHandler,
                    dosersArray[ind]);
                                        // TODO Селать проверку на было ли уже событие в текущем дне
                                      */
                }
            }
        }
        document.shrinkToFit();
        document.clear();
    }
}

void parseJSONCompressor(const String& response) {
    DynamicJsonDocument doc(250);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

            compressor->setState(state);
            compressor->setEnabled(enabled);
            compressor->setPin(pin);
            compressor->setObjectID(objectId);
            compressor->setOn(static_cast<time_t>(std::stoul(on)));
            compressor->setOff(static_cast<time_t>(std::stoul(off)));
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

