Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void parseJSONFlow(const String& response) {
    DynamicJsonDocument doc(250);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

            flow->setState(state);
            flow->setEnabled(enabled);
            flow->setPin(pin);
            flow->setObjectID(objectId);
            flow->setOn(static_cast<time_t>(std::stoul(on)));
            flow->setOff(static_cast<time_t>(std::stoul(off)));
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

void parseJSONCO2(const String& response) {
    DynamicJsonDocument doc(250);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

            co2->setState(state);
            co2->setEnabled(enabled);
            co2->setPin(pin);
            co2->setObjectID(objectId);
            co2->setOn(static_cast<time_t>(std::stoul(on)));
            co2->setOff(static_cast<time_t>(std::stoul(off)));
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

void setHostName() {
#ifdef ARDUINO_ARCH_ESP8266
    WiFi.hostname(WiFi_hostname);
#else
    WiFi.setHostname(WiFi_hostname);
#endif
}

boolean initWiFi() {
    Serial.printf_P(PSTR("%s: %s\n"), "Подключение к WiFi", WIFI_SSID);
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    WiFi.setAutoReconnect(true);
    while ((WiFi.status() != WL_CONNECTED) && (wifiConnectCount != wifiMaxTry)) {
        Serial.printf_P(PSTR("%s"), ".");
        delay(500);
        wifiConnectCount++;
    }

    if (WiFi.status() != WL_CONNECTED) {
        wifiConnectCount = 0;
        Serial.printf_P(PSTR("%s: %s\n"), "Не удалось подключиться к WiFi", WIFI_SSID);
        return false;
    } else {
        Serial.printf_P(PSTR("\n%s: %s IP: %s\n"), "Успешное подключение к WiFi", WIFI_SSID, WiFi.localIP().toString().c_str());
        setHostName();
        return true;
    }
}

void attachLightScheduler() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isLight()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = schedule.getDevice();
        auto alarmOn = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, deviceOnHandler, sensor);
        auto alarmOff = Alarm.alarmRepeat(sensor->getHourOff(), sensor->getMinuteOff(), 0, deviceOffHandler, sensor);

        schedule.setOn(alarmOn);
        schedule.setOff(alarmOff);
        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? deviceOnHandler(sensor)
                                                                                        : deviceOffHandler(sensor);
    }
}

void attachCompressorScheduler() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isCompressor()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = schedule.getDevice();
        auto alarmOn = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, deviceOnHandler, sensor);
        auto alarmOff = Alarm.alarmRepeat(sensor->getHourOff(), sensor->getMinuteOff(), 0, deviceOffHandler, sensor);

        schedule.setOn(alarmOn);
        schedule.setOff(alarmOff);
        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? deviceOnHandler(sensor)
                                                                                        : deviceOffHandler(sensor);
    }
}

void attachFlowScheduler() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isFlow()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = schedule.getDevice();
        auto alarmOn = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, deviceOnHandler, sensor);
        auto alarmOff = Alarm.alarmRepeat(sensor->getHourOff(), sensor->getMinuteOff(), 0, deviceOffHandler, sensor);

        schedule.setOn(alarmOn);
        schedule.setOff(alarmOff);
        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? deviceOnHandler(sensor)
                                                                                        : deviceOffHandler(sensor);
    }
}

void attachCO2Scheduler() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isCO2()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = schedule.getDevice();
        auto alarmOn = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, deviceOnHandler, sensor);
        auto alarmOff = Alarm.alarmRepeat(sensor->getHourOff(), sensor->getMinuteOff(), 0, deviceOffHandler, sensor);

        schedule.setOn(alarmOn);
        schedule.setOff(alarmOff);
        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? deviceOnHandler(sensor)
                                                                                        : deviceOffHandler(sensor);
    }
}

void attachDosersScheduler() {
    std::unique_ptr<GBasic> emptyDoser{};
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isDoser()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = static_cast<Doser*>(schedule.getDevice());

